avr-rust/avrd/packs/xmegaa/ATxmega256A3U.atdf
        <module name="AWEX" id="I6090" version="XMEGAAU">
          <instance name="AWEXC">
            <register-group address-space="data" offset="0x880" name-in-module="AWEX" name="AWEXC"/>
            <signals>
              <signal function="AWEX" group="OC0ALS" pad="PC0"/>
              <signal function="AWEX" group="OC0AHS" pad="PC1"/>
              <signal function="AWEX" group="OC0BLS" pad="PC2"/>
              <signal function="AWEX" group="OC0BHS" pad="PC3"/>
              <signal function="AWEX" group="OC0CLS" pad="PC4"/>
              <signal function="AWEX" group="OC0CHS" pad="PC5"/>
              <signal function="AWEX" group="OC0DLS" pad="PC6"/>
              <signal function="AWEX" group="OC0DHS" pad="PC7"/>
            </signals>
          </instance>
          <instance name="AWEXE">
            <register-group address-space="data" offset="0xA80" name-in-module="AWEX" name="AWEXE"/>
            <signals>
              <signal function="AWEX" group="OC0ALS" pad="PE0"/>
              <signal function="AWEX" group="OC0AHS" pad="PE1"/>
              <signal function="AWEX" group="OC0BLS" pad="PE2"/>
              <signal function="AWEX" group="OC0BHS" pad="PE3"/>
              <signal function="AWEX" group="OC0CLS" pad="PE4"/>
              <signal function="AWEX" group="OC0CHS" pad="PE5"/>
              <signal function="AWEX" group="OC0DLS" pad="PE6"/>
              <signal function="AWEX" group="OC0DHS" pad="PE7"/>
            </signals>
          </instance>
        </module>
        <module name="HIRES" id="I6090" version="XMEGAAU">
          <instance name="HIRESC">
            <register-group address-space="data" offset="0x890" name-in-module="HIRES" name="HIRESC"/>
          </instance>
          <instance name="HIRESD">
            <register-group address-space="data" offset="0x990" name-in-module="HIRES" name="HIRESD"/>
          </instance>
          <instance name="HIRESE">
            <register-group address-space="data" offset="0xA90" name-in-module="HIRES" name="HIRESE"/>
          </instance>
          <instance name="HIRESF">
            <register-group address-space="data" offset="0xB90" name-in-module="HIRES" name="HIRESF"/>
          </instance>
        </module>
        <module name="USART" id="I6090" version="XMEGAAU">
          <instance name="USARTC0">
            <register-group address-space="data" offset="0x8A0" name-in-module="USART" name="USARTC0"/>
            <signals>
              <signal field="USART0" function="USART" group="XCK" pad="PC1"/>
              <signal field="USART0" function="USART" group="RXD" pad="PC2"/>
              <signal field="USART0" function="USART" group="TXD" pad="PC3"/>
              <signal field="USART0" function="USART_ALT" group="XCK" pad="PC5"/>
              <signal field="USART0" function="USART_ALT" group="RXD" pad="PC6"/>
              <signal field="USART0" function="USART_ALT" group="TXD" pad="PC7"/>
            </signals>
          </instance>
          <instance name="USARTC1">
            <register-group address-space="data" offset="0x8B0" name-in-module="USART" name="USARTC1"/>
            <signals>
              <signal function="USART" group="XCK" pad="PD5"/>
              <signal function="USART" group="RXD" pad="PD6"/>
              <signal function="USART" group="TXD" pad="PD7"/>
            </signals>
          </instance>
          <instance name="USARTD0">
            <register-group address-space="data" offset="0x9A0" name-in-module="USART" name="USARTD0"/>
            <signals>
              <signal field="USART0" function="USART" group="XCK" pad="PD1"/>
              <signal field="USART0" function="USART" group="RXD" pad="PD2"/>
              <signal field="USART0" function="USART" group="TXD" pad="PD3"/>
              <signal field="USART0" function="USART_ALT" group="XCK" pad="PD5"/>
              <signal field="USART0" function="USART_ALT" group="RXD" pad="PD6"/>
              <signal field="USART0" function="USART_ALT" group="TXD" pad="PD7"/>
            </signals>
          </instance>
          <instance name="USARTD1">
            <register-group address-space="data" offset="0x9B0" name-in-module="USART" name="USARTD1"/>
            <signals>
              <signal function="USART" group="XCK" pad="PD5"/>
              <signal function="USART" group="RXD" pad="PD6"/>
              <signal function="USART" group="TXD" pad="PD7"/>
            </signals>
          </instance>
          <instance name="USARTE0">
            <register-group address-space="data" offset="0xAA0" name-in-module="USART" name="USARTE0"/>
            <signals>
              <signal field="USART0" function="USART" group="XCK" pad="PE1"/>
              <signal field="USART0" function="USART" group="RXD" pad="PE2"/>
              <signal field="USART0" function="USART" group="TXD" pad="PE3"/>
              <signal field="USART0" function="USART_ALT" group="XCK" pad="PE5"/>
              <signal field="USART0" function="USART_ALT" group="RXD" pad="PE6"/>
              <signal field="USART0" function="USART_ALT" group="TXD" pad="PE7"/>
            </signals>
          </instance>
          <instance name="USARTE1">
            <register-group address-space="data" offset="0xAB0" name-in-module="USART" name="USARTE1"/>
            <signals>
              <signal function="USART" group="XCK" pad="PE5"/>
              <signal function="USART" group="RXD" pad="PE6"/>
              <signal function="USART" group="TXD" pad="PE7"/>
            </signals>
          </instance>
          <instance name="USARTF0">
            <register-group address-space="data" offset="0xBA0" name-in-module="USART" name="USARTF0"/>
            <signals>
              <signal field="USART0" function="USART" group="XCK" pad="PF1"/>
              <signal field="USART0" function="USART" group="RXD" pad="PF2"/>
              <signal field="USART0" function="USART" group="TXD" pad="PF3"/>
              <signal field="USART0" function="USART_ALT" group="XCK" pad="PF5"/>
              <signal field="USART0" function="USART_ALT" group="RXD" pad="PF6"/>
              <signal field="USART0" function="USART_ALT" group="TXD" pad="PF7"/>
            </signals>
          </instance>
        </module>
        <module name="SPI" id="I6090" version="XMEGAAU">
          <instance name="SPIC">
            <register-group address-space="data" offset="0x8C0" name-in-module="SPI" name="SPIC"/>
            <signals>
              <signal field="SPI" function="SPI" group="SS" pad="PC4"/>
              <signal field="SPI" function="SPI" group="MOSI" pad="PC5"/>
              <signal field="SPI" function="SPI" group="MISO" pad="PC6"/>
              <signal field="SPI" function="SPI" group="SCK" pad="PC7"/>
              <signal field="SPI" function="SPI_ALT" group="SS" pad="PC4"/>
              <signal field="SPI" function="SPI_ALT" group="SCK" pad="PC5"/>
              <signal field="SPI" function="SPI_ALT" group="MISO" pad="PC6"/>
              <signal field="SPI" function="SPI_ALT" group="MOSI" pad="PC7"/>
            </signals>
          </instance>
