avr-rust/avrd/packs/xmegaa/ATxmega256A3U.atdf
        <register caption="Control Register C" name="CTRLC" offset="0x02" size="1">
          <bitfield caption="Reference Select" mask="0x18" name="REFSEL" values="DAC_REFSEL"/>
          <bitfield caption="Left-adjust Result" mask="0x01" name="LEFTADJ"/>
        </register>
        <register caption="Event Input Control" name="EVCTRL" offset="0x03" size="1">
          <bitfield caption="Separate Event Channel Input for Channel 1" mask="0x08" name="EVSPLIT"/>
          <bitfield caption="Event Input Selection" mask="0x07" name="EVSEL" values="DAC_EVSEL"/>
        </register>
        <register caption="Status" name="STATUS" offset="0x05" size="1">
          <bitfield caption="Channel 1 Data Register Empty" mask="0x02" name="CH1DRE"/>
          <bitfield caption="Channel 0 Data Register Empty" mask="0x01" name="CH0DRE"/>
        </register>
        <register caption="Gain Calibration" name="CH0GAINCAL" offset="0x08" size="1">
          <bitfield caption="Gain Calibration" mask="0x7F" name="CH0GAINCAL"/>
        </register>
        <register caption="Offset Calibration" name="CH0OFFSETCAL" offset="0x09" size="1">
          <bitfield caption="Offset Calibration" mask="0x7F" name="CH0OFFSETCAL"/>
        </register>
        <register caption="Gain Calibration" name="CH1GAINCAL" offset="0x0A" size="1">
          <bitfield caption="Gain Calibration" mask="0x7F" name="CH1GAINCAL"/>
        </register>
        <register caption="Offset Calibration" name="CH1OFFSETCAL" offset="0x0B" size="1">
          <bitfield caption="Offset Calibration" mask="0x7F" name="CH1OFFSETCAL"/>
        </register>
        <register caption="Channel 0 Data" name="CH0DATA" offset="0x18" size="2"/>
        <register caption="Channel 1 Data" name="CH1DATA" offset="0x1A" size="2"/>
      </register-group>
      <value-group caption="Output channel selection" name="DAC_CHSEL">
        <value caption="Single channel operation (Channel 0 only)" name="SINGLE" value="0x00"/>
        <value caption="Single channel operation (Channel 1 only)" name="SINGLE1" value="0x01"/>
        <value caption="Dual channel operation (Channel 0 and channel 1)" name="DUAL" value="0x02"/>
      </value-group>
      <value-group caption="Reference voltage selection" name="DAC_REFSEL">
        <value caption="Internal 1V " name="INT1V" value="0x00"/>
        <value caption="Analog supply voltage" name="AVCC" value="0x01"/>
        <value caption="External reference on AREF on PORTA" name="AREFA" value="0x02"/>
        <value caption="External reference on AREF on PORTB" name="AREFB" value="0x03"/>
      </value-group>
      <value-group caption="Event channel selection" name="DAC_EVSEL">
        <value caption="Event Channel 0" name="0" value="0x00"/>
        <value caption="Event Channel 1" name="1" value="0x01"/>
        <value caption="Event Channel 2" name="2" value="0x02"/>
        <value caption="Event Channel 3" name="3" value="0x03"/>
        <value caption="Event Channel 4" name="4" value="0x04"/>
        <value caption="Event Channel 5" name="5" value="0x05"/>
        <value caption="Event Channel 6" name="6" value="0x06"/>
        <value caption="Event Channel 7" name="7" value="0x07"/>
      </value-group>
    </module>
    <module name="AC" id="I6077" version="XMEGAAU" caption="Analog Comparator">
      <register-group caption="Analog Comparator" name="AC" size="8">
        <register caption="Analog Comparator 0 Control" name="AC0CTRL" offset="0x00" size="1">
          <bitfield caption="Interrupt Mode" mask="0xC0" name="INTMODE" values="AC_INTMODE"/>
          <bitfield caption="Interrupt Level" mask="0x30" name="INTLVL" values="AC_INTLVL"/>
          <bitfield caption="High-speed Mode" mask="0x08" name="HSMODE"/>
          <bitfield caption="Hysteresis Mode" mask="0x06" name="HYSMODE" values="AC_HYSMODE"/>
          <bitfield caption="Enable" mask="0x01" name="ENABLE"/>
        </register>
        <register caption="Analog Comparator 1 Control" name="AC1CTRL" offset="0x01" size="1">
          <bitfield caption="Interrupt Mode" mask="0xC0" name="INTMODE" values="AC_INTMODE"/>
          <bitfield caption="Interrupt Level" mask="0x30" name="INTLVL" values="AC_INTLVL"/>
          <bitfield caption="High-speed Mode" mask="0x08" name="HSMODE"/>
          <bitfield caption="Hysteresis Mode" mask="0x06" name="HYSMODE" values="AC_HYSMODE"/>
          <bitfield caption="Enable" mask="0x01" name="ENABLE"/>
        </register>
        <register caption="Analog Comparator 0 MUX Control" name="AC0MUXCTRL" offset="0x02" size="1">
          <bitfield caption="MUX Positive Input" mask="0x38" name="MUXPOS" values="AC_MUXPOS"/>
          <bitfield caption="MUX Negative Input" mask="0x07" name="MUXNEG" values="AC_MUXNEG"/>
        </register>
        <register caption="Analog Comparator 1 MUX Control" name="AC1MUXCTRL" offset="0x03" size="1">
          <bitfield caption="MUX Positive Input" mask="0x38" name="MUXPOS" values="AC_MUXPOS"/>
          <bitfield caption="MUX Negative Input" mask="0x07" name="MUXNEG" values="AC_MUXNEG"/>
        </register>
        <register caption="Control Register A" name="CTRLA" offset="0x04" size="1">
          <bitfield caption="Analog Comparator 1 Output Enable" mask="0x02" name="AC1OUT"/>
          <bitfield caption="Analog Comparator 0 Output Enable" mask="0x01" name="AC0OUT"/>
        </register>
        <register caption="Control Register B" name="CTRLB" offset="0x05" size="1">
          <bitfield caption="VCC Voltage Scaler Factor" mask="0x3F" name="SCALEFAC"/>
        </register>
        <register caption="Window Mode Control" name="WINCTRL" offset="0x06" size="1">
          <bitfield caption="Window Mode Enable" mask="0x10" name="WEN"/>
          <bitfield caption="Window Interrupt Mode" mask="0x0C" name="WINTMODE" values="AC_WINTMODE"/>
          <bitfield caption="Window Interrupt Level" mask="0x03" name="WINTLVL" values="AC_WINTLVL"/>
        </register>
        <register caption="Status" name="STATUS" offset="0x07" size="1">
          <bitfield caption="Window Mode State" mask="0xC0" name="WSTATE" values="AC_WSTATE"/>
          <bitfield caption="Analog Comparator 1 State" mask="0x20" name="AC1STATE"/>
          <bitfield caption="Analog Comparator 0 State" mask="0x10" name="AC0STATE"/>
          <bitfield caption="Window Mode Interrupt Flag" mask="0x04" name="WIF"/>
          <bitfield caption="Analog Comparator 1 Interrupt Flag" mask="0x02" name="AC1IF"/>
          <bitfield caption="Analog Comparator 0 Interrupt Flag" mask="0x01" name="AC0IF"/>
        </register>
        <register caption="Current Source Control" name="CURRCTRL" offset="0x08" size="1">
          <bitfield caption="Current Source Enable" mask="0x80" name="CURRENT"/>
          <bitfield caption="Current Mode" mask="0x40" name="CURRMODE"/>
          <bitfield caption="AC1 Current Source Output Enable" mask="0x02" name="AC1CURR"/>
          <bitfield caption="AC0 Current Source Output Enable" mask="0x01" name="AC0CURR"/>
        </register>
        <register caption="Current Source Calibration" name="CURRCALIB" offset="0x09" size="1">
          <bitfield caption="Current Source Calibration" mask="0x0F" name="CALIB"/>
        </register>
      </register-group>
      <value-group caption="Interrupt mode" name="AC_INTMODE">
        <value caption="Interrupt on both edges" name="BOTHEDGES" value="0x00"/>
        <value caption="Interrupt on falling edge" name="FALLING" value="0x02"/>
        <value caption="Interrupt on rising edge" name="RISING" value="0x03"/>
      </value-group>
      <value-group caption="Interrupt level" name="AC_INTLVL">
        <value caption="Interrupt disabled" name="OFF" value="0x00"/>
        <value caption="Low level" name="LO" value="0x01"/>
        <value caption="Medium level" name="MED" value="0x02"/>
        <value caption="High level" name="HI" value="0x03"/>
      </value-group>
